AUC是个评价分类器性能的重要指标，我们的实习是基于itemScore数据集来用SQL计算AUC指标。

itemscore(c1,c2)

In [2]:
mysql://stu2101213030:stu2101213030@162.105.146.37:43306

In [3]:
show databases;

,Database
0,dataset
1,information_schema
2,stu2101213030

In [4]:
use dataset;

In [5]:
show tables;

,Tables_in_dataset
0,SurnameOrigin
1,TheWorldHappinessReport2015
2,TheWorldHappinessReport2016
3,TheWorldHappinessReport2017
4,TheWorldHappinessReport2018
5,TheWorldHappinessReport2019
6,itemscore
7,stock
8,supermarketTrans
9,titanic_gender_submission
10,titanic_test
11,titanic_train
12,xzqh

In [6]:
select * from itemscore limit 10;

,c1,c2
0,0.1103,-1.0
1,0.1708,-1.0
2,0.2887,1.0
3,0.0861,-1.0
4,0.1009,1.0
5,0.4262,-1.0
6,0.1034,-1.0
7,0.1923,-1.0
8,0.3172,-1.0
9,0.1022,-1.0